def clc():
    H = 200
    B = 1000
    t = 20
    s = 10
    n=0
    Jx_ult = 7000
    x1 = ((2 * t * H ** 2) + ((B - 2 * t) * s ** 2)) / (2 * ((2 * t * H) + (B - 2 * t) * s))

    x2 = H - x1

    Jx = (((B * (x1 ** 3)) - ((B - 2 * t) * ((x1 - s) ** 3)) + (2 * t * (x2 ** 3))) / 3) / 10000

    # Проверка совпадения значений моментов инерции
    Chek = (Jx == Jx_ult)
    # Цикл подбора толщин по исходному моменту инерции
    while Chek == False:
        t = t + 0.0000001

        s = s + 0.0000001

        x1 = ((2 * t * H ** 2) + ((B - 2 * t) * s ** 2)) / (2 * ((2 * t * H) + (B - 2 * t) * s))

        x2 = H - x1

        Jx = (((B * (x1 ** 3)) - ((B - 2 * t) * ((x1 - s) ** 3)) + (2 * t * (x2 ** 3))) / 3) / 10000

        n= n+1



        Chek = (Jx >= Jx_ult)
    print(Jx)
    print(n)
clc()
